app/views/account/posts/index.html.erb

          <td> <%= post.content %> </td>
          <td> <%= post.group.title %> </td>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 2]]