app/views/groups/show.html.erb


           <%= link_to("Edit", edit_group_post_path(post.group, post),
                       class: "btn btn-default btn-xs")%>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]