app/views/account/groups/index.html.erb

          <td> <%= group.description %> </td>
          <!-- <td> <%= group.posts.count %> </td> -->
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."group_id" = ?  [["group_id", 5]]