app/controllers/groups_controller.rb

INSERT INTO "groups" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "1234"], ["description", "1234"], ["user_id", 1], ["created_at", "2016-05-19 09:51:44.849361"], ["updated_at", "2016-05-19 09:51:44.849361"]]
---
    def create
       #@group = Group.new(group_params)
       @group = current_user.groups.new(group_params)
      if @group.save

SELECT  "groups".* FROM "groups" WHERE "groups"."user_id" = ? AND "groups"."id" = ? LIMIT 1  [["user_id", 1], ["id", 5]]
---
    def edit
      #@group = Group.find(params[:id])
    @group = current_user.groups.find(params[:id])

SELECT  "groups".* FROM "groups" WHERE "groups"."user_id" = ? AND "groups"."id" = ? LIMIT 1  [["user_id", 1], ["id", 5]]
UPDATE "groups" SET "description" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["description", "456555"], ["updated_at", "2016-05-19 08:40:51.794361"], ["id", 1]]
---
    def update
      #@group = Group.find(params[:id])
      @group = current_user.groups.find(params[:id])
      if @group.update(group_params)

SELECT  "groups".* FROM "groups" WHERE "groups"."user_id" = ? AND "groups"."id" = ? LIMIT 1  [["user_id", 1], ["id", 6]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]
---
    def destroy
      #@group = Group.find(params[:id])
      @group = current_user.groups.find(params[:id])
      @group.destroy

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 5]]
---
   def join
     @group = Group.find(params[:id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 5]]
---
   def quit
    @group = Group.find(params[:id])