app/controllers/posts_controller.rb

    def create
      #@group = Group.find(params[:group_id])
      @post = @group.posts.build(post_params)
      @post.author = current_user

      if @post.save
---
INSERT INTO "posts" ("content", "group_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "err"], ["group_id", 2], ["user_id", 1], ["created_at", "2016-05-19 09:50:24.145094"], ["updated_at", "2016-05-19 09:50:24.145094"]]

    def update
       #@group = Group.find(params[:group_id])
       #@post = @group.posts.find(params[:id])
       @post = current_user.posts.find(params[:id])
      if @post.update(post_params)
---
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "測試111"], ["updated_at", "2016-05-19 09:06:51.242710"], ["id", 1]]

    def destroy
      #@group = Group.find(params[:group_id])
      #@post = @group.posts.find(params[:id])
      @post = current_user.posts.find(params[:id])

      @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]

    def find_group
      @group = Group.find(params[:group_id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 2]]